GAN = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
ZHI = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]
WUXING = ["木", "火", "土", "金", "水"]
SHUXIANG = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]
NUMBER = ["零", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十"]
YUE = ["十一", "十二", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十" ]
RI = ["初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", 
    "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", 
    "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"]
CONSTELLATION = ['摩羯', '水瓶', '双鱼', '白羊', '金牛', '双子', '巨蟹', '狮子', '处女', '天秤', '天蝎', '射手']
WEEKDAY = ["星期日", "星期一", "星期二", "星期三", "星期四", "星期五", "星期六"]

JIEQI                     = ["冬至", "小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑","白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪"]
mapping_JIEQI_to_YUEJIANG = [   0  ,     0 ,     1 ,     1 ,     2 ,     2 ,     3 ,     3 ,     4 ,     4 ,     5 ,     5 ,     6 ,    6 ,     7 ,     7 ,     8 ,     8 ,     9 ,     9 ,     10,     10,     11,     11]
YUEJIANG = ["丑","子","亥","戌","酉","申","未","午","巳","辰","卯","寅"]
YUEJIANG_to_NAME = {"丑":"大吉","子":"天后","亥":"登明","戌":"河魁",
                    "酉":"从魁","申":"传送","未":"小吉","午":"胜光",
                    "巳":"太乙","辰":"天罡","卯":"太冲","寅":"功曹"}


TIANJIANG = [ "贵人",	"螣蛇",	"朱雀",	"六合",	"勾陈",	"青龙",	"天空",	"白虎",	"太常",	"玄武",	"太阴",	"天后"]
TIANJIANG_short = [ "贵",	"蛇",	"朱",	"合",	"勾",	"龙",	"空",	"虎",	"常",	"玄",	"阴",	"后"]
mapping_GAN_to_GUIREN_pos = { "甲":"丑未", "戊":"丑未", "庚":"丑未", "乙":"子申", "己":"子申", "丙":"亥酉", "丁":"亥酉", "壬":"巳卯", "癸":"巳卯", "辛":"午寅" }
'''
甲戊庚牛羊，乙己鼠猴乡；
丙丁猪鸡位，壬癸蛇兔藏；
六辛逢马虎，此是贵人方。
'''
'''
正月，北斗勺柄指向寅，月建为寅；在雨水节气后，太阳落山处于二十八宿室、壁亥宫，故月将为登明亥
二月，北斗勺柄指向卯，月建为卯；在春分节气后，太阳落山处于二十八宿奎、娄戌宫，故月将河魁戌
三月，北斗勺柄指向辰，月建为辰；在谷雨节气后，太阳落山处于二十八宿胃、昴、毕酉宫，故月将从魁酉
四月，北斗勺柄指向巳，月建为巳；在小满节气后，太阳落山处于二十八宿觜、参申宫，故月将传送申
五月，北斗勺柄指向午，月建为午；在夏至节气后，太阳落山处于二十八宿井、鬼未宫，故月将小吉未
六月，北斗勺柄指向未，月建为未；在大暑节气后，太阳落山处于二十八宿柳、星、张午宫，故月将胜光午
七月，北斗勺柄指向申，月建为申；在处暑节气后，太阳落山处于二十八宿翼、轸巳宫，故月将太乙巳
八月，北斗勺柄指向酉，月建为酉；在秋分节气后，太阳落山处于二十八宿角、亢辰宫，故月将天罡辰
九月，北斗勺柄指向戌，月建为戌；在霜降节气后，太阳落山处于二十八宿氐、房、心卯宫，故月将太冲卯
十月，北斗勺柄指向亥，月建为亥；在小雪节气后，太阳落山处于二十八宿尾、箕寅宫，故月将功曹寅
冬月，北斗勺柄指向子，月建为子；在冬至节气后，太阳落山处于二十八宿斗、牛丑宫，故月将大吉丑
腊月，北斗勺柄指向丑，月建为丑；在大寒节气后，太阳落山处于二十八宿女、虚、危子宫，故月将神后子
'''

BIFAFU='''
第一法：前后引从升迁吉，
第二法：首尾相见始终宜。
第三法：帘幕贵人高甲第，
第四法：催官使者赴官期。
第五法：六阳数足须公用，
第六法：六阴相继尽昏迷。
第七法：旺禄临身徒妄作，
第八法：权摄不正禄临支。
第九法：避难逃生须弃旧，
第十法：朽木难雕别作为。
第十一法：众鬼虽彰全不畏，
第十二法：虽忧狐假虎威仪。
第十三法：鬼贼当时无畏忌，
第十四法：传财太旺反财亏。
第十五法：脱上逢脱防虚诈，
第十六法：空上乘空事莫追。
第十七法：进茹空亡宜退步，
第十八法：踏脚空亡进用宜。
第十九法：胎财生气妻怀孕，
第二十法：胎财死气损胎推。
第二十一法：交车相合交关利，第二十二法：上下皆合两心齐。第二十三法：彼求我事支传干，第二十四法：我求彼事干传支。第二十五法：金日逢丁凶祸动，第二十六法：水日逢丁财动之。第二十七法：传财化鬼财休觅，第二十八法：传鬼化财钱险危。第二十九法：眷属丰盈居狭宅，第三十法：屋宅宽广致人衰。
第三十一法：三传递生人举荐，第三十二法：三传互克众人欺。第三十三法：有始无终难变易，第三十四法：苦去甘来乐里悲。第三十五法：人宅受脱俱招盗，第三十六法：干支皆败事倾颓。第三十七法：末助初兮三等讼，第三十八法：闭口卦体两般推。第三十九法：太阳照武宜擒贼，第四十法：后合占婚岂用媒。
第四十一法：富贵干支逢禄马，第四十二法：尊崇传内遇三奇。第四十三法：害贵讼直作曲断，第四十四法：课传俱贵转无依。第四十五法：昼夜贵加求两贵，第四十六法：贵人差迭事参差。第四十七法：贵虽在狱宜临干，第四十八法：鬼乘天乙乃神祗。第四十九法：两贵受克难干贵，第五十法：二贵皆空虚喜期。
第五十一法：魁度天门关隔定，第五十三法：罡塞鬼户任谋为。第五十三法：两蛇夹墓凶难免，第五十四法：虎视逢虎力难施。第五十五法：所谋多拙逢网罗，第五十六法：天网自裹己招非。第五十七法：费有余而得不足，第五十八法：用破身心无所归。第五十九法：华盖覆日人昏晦，第六十法：太阳射宅屋光辉。
第六十一法：干乘墓虎无占病，第六十二法：支乘墓虎有伏尸。第六十三法：彼此全伤防两损，第六十四法：夫妇芜淫各有私。第六十五法：干墓并关人宅废，第六十六法：支坟财并旅程稽。第六十七法：受虎克神为病症，第六十八法：制鬼之位乃良医。第六十九法：虎乘遁鬼殃非浅，第七十法：鬼临三四讼灾随。
第七十一法：病符克宅全家患，第七十二法：丧吊全逢挂缟衣。第七十三法：前后逼迫难进退，第七十四法：空空如也事休追。第七十五法：宾主不投刑在上，第七十六法：彼此猜忌害相随。第七十七法：互生俱生凡事益，第七十八法：互旺皆旺坐谋宜。第七十九法：干支值绝凡谋决，第八十法：人宅皆死各衰羸。
第八十一法：传墓入墓分憎爱。
第八十二法：不行传者考初时  第八十三法：万事喜忻三六合，第八十四法：合中犯杀蜜中砒。 第八十五法：初遭夹克不由己，第八十六法：将逢内战所谋危。 第八十七法：人宅坐墓甘招晦，第八十八法：干支乘墓各昏迷。 第八十九法：任信丁马须言动，第九十法：来去俱空岂动宜。
第九十一法：虎临干鬼凶速速，第九十二法：龙加生气吉迟迟。 第九十三法：妄用三传灾福异，第九十四法：喜惧空亡乃妙机。 第九十五法：六爻现卦防其克，第九十六法：旬内空亡逐类推。 第九十七法：所筮不入仍凭类，第九十八法：非占现类勿言之  第九十九法：常问不应逢吉象，第一百法：已灾凶逃返无疑。

'''